Revit 2024 API
DocumentEntryPoint.Delete Method
Overload List
Name | Description
Delete(ElementId)
 Deletes an element from the document given the id of that element.
 (Inherited from Document.)
Delete(ICollection<ElementId>)
 Deletes a set of elements from the document.
 (Inherited from Document.)
See Also
DocumentEntryPoint Class
DocumentEntryPoint Members
Autodesk.Revit.DB.Macros Namespace